Tekla Open API Reference for Tekla Structures 2025
Distance Methods
The Distance type exposes the following members.
Methods
Name | Description
CompareTo
 Compares the current object with another object of the same type.
ConvertTo
 Converts the distance to the specified units.
Equals(Object)
 Indicates whether the current instance and the specified object are equal.
 (Overrides ValueType.Equals(Object).)
Equals(Distance)
 Indicates whether the current object is equal to another object of the same type.
FromDecimalString(String)
 Creates a distance from a decimal string representation.
FromDecimalString(String, IFormatProvider)
 Creates a distance from a decimal string representation.
FromDecimalString(String, IFormatProvider, Distance.UnitType)
 Creates a distance from a decimal string representation.
FromFractionalFeetAndInchesString(String)
 Creates a distance from a string representation of fractional feet and inches.
FromFractionalFeetAndInchesString(String, IFormatProvider, Distance.UnitType)
 Creates a distance from a string representation of fractional feet and inches.
GetHashCode
 Returns the hash code for the current instance.
 (Overrides ValueType.GetHashCode().)
Parse(String)
 Parses a distance from a string representation using the current unit type and culture.
Parse(String, IFormatProvider)
 Parses a distance from a string representation using the current unit type and the given culture.
Parse(String, IFormatProvider, Distance.UnitType)
 Parses a distance from a string representation using the given unit type and culture.
ToDecimalString()
 Converts the distance to a decimal string representation.
ToDecimalString(IFormatProvider)
 Converts the distance to a decimal string representation.
ToDecimalString(String)
 Converts the distance to a decimal string representation.
ToDecimalString(String, IFormatProvider)
 Converts the distance to a decimal string representation.
ToDecimalString(String, IFormatProvider, Distance.UnitType)
 Converts the distance to a decimal string representation.
ToFractionalFeetAndInchesString()
 Creates a string representation of the distance in feet and inches.
ToFractionalFeetAndInchesString(IFormatProvider)
 Creates a string representation of the distance in feet and inches.
ToFractionalInchesString()
 Creates a string representation of the distance in inches.
ToFractionalInchesString(IFormatProvider)
 Creates a string representation of the distance in inches.
ToString()
 Creates a string representation of the distance.
 (Overrides ValueType.ToString().)
ToString(IFormatProvider)
 Creates a string representation of the distance.
ToString(String)
 Creates a string representation of the distance.
ToString(String, IFormatProvider)
 Creates a string representation of the distance.
ToString(String, IFormatProvider, Distance.UnitType)
 Creates a string representation of the distance.
TryParse(String, Distance)
 Attempts to parse a distance from a string representation using the current units.
TryParse(String, IFormatProvider, Distance)
 Attempts to parse a distance from a string representation using the current units.
TryParse(String, IFormatProvider, Distance.UnitType, Distance)
 Attempts to parse a distance from a string representation using the current units.
Top
See Also
Reference
Distance Structure
Tekla.Structures.Datatype Namespace